Autodesk.Revit.DB.FabricationPart.GetInsulationLiningGeometry
Gets insulation and lining geometry for this fabrication part.
Returns:
Returns any insulation and liner geometry.
Since:
2019.1

Autodesk.Revit.DB.FabricationPart.IsSameAs(Autodesk.Revit.DB.FabricationPart,System.Collections.Generic.IList{Autodesk.Revit.DB.Fabrication.FabricationPartCompareType})
Compare this fabrication part with the part passed and checks the pattern dimensions and options. A list of fields that can be ignored in the comparison check can be specified.
part:
The part to compare this part with.
ignoreFields:
Array of types of data to ignore from the comparison check.
Returns:
Returns true if the fabrication parts are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.FabricationPart.GetPartAncillaryUsage
Gets a list of all ancillary usage information for the part.
Returns:
Returns array of usage information, one per unique type of ancillary used.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.RemovePartCustomData(System.Int32)
Remove custom data from the fabrication part.
customId:
The identifier of the custom data field to remove.
Returns:
Returns true if the type was found and removed. The type will not be removed if it is not an optional type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Since:
2018

Autodesk.Revit.DB.FabricationPart.AddPartCustomData(System.Int32)
Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.
Remarks:
The custom id must be positive.
customId:
The identifier of the custom data field to add.
Returns:
Returns true if the type was not already present.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data id does not exist.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SetPartCustomDataReal(System.Int32,System.Double)
Set the custom data real value for the specified custom data.
customId:
The identifier of the custom data field to set.
value:
The real value of the custom data. If the data is not a real type the value will be parsed according to the fabrication confifuration rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SetPartCustomDataInteger(System.Int32,System.Int32)
Set the custom data integer value for the specified custom data.
customId:
The identifier of the custom data field to set.
value:
The integer value of the custom data. If the data is not an integer type the value will be parsed according to the fabrication confifuration rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SetPartCustomDataText(System.Int32,System.String)
Set the custom data real value for the specified custom data.
customId:
The identifier of the custom data field to set.
value:
The text value of the custom data. If the data is not a text type the value will be parsed according to the fabrication confifuration rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.GetPartCustomDataReal(System.Int32)
Get custom data real value for the specified custom data.
customId:
The identifier of the custom data field to get.
Returns:
Returns the real number of the custom data. If the data is not a number it will return 0.0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.GetPartCustomDataInteger(System.Int32)
Get custom data integer value for the specified custom data.
customId:
The identifier of the custom data field to get.
Returns:
Returns the integer of the custom data. If the data is not a number it will return 0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.GetPartCustomDataText(System.Int32)
Get custom data text for the specified custom data.
customId:
The identifier of the custom data field to get.
Returns:
Returns the text of the custom data. If the data is a number it will be formatted according to the fabrication configuration's rules.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The custom data does not exist on the part.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.HasCustomData(System.Int32)
Check if fabrication part contains custom data already.
customId:
The identifier of the custom data field to look for.
Returns:
Returns true if the fabrication part contains the custom data.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.HasNoConnections
Checks to see if all the fabrication part's connectors are open.
Returns:
Returns true if the part has zero connections.
Since:
2018

Autodesk.Revit.DB.FabricationPart.RotateConnectedPartByConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,System.Double)
Rotates a connected fabrication part around the axis of the specified connector.
Remarks:
Attempts to resize rectangular and oval ends if the angle is a multiple of PI/2.
Taps cannot be rotated.
For rectangular and oval profiles only 90, 180 and 270 degree rotations are valid.
doc:
The document.
conn:
The connected connector of the fabrication part to be rotated.
axisRotationBy:
The angle in radians to rotate by.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
Connector is not connected.
-or-
Connector belongs to a fabrication part tap.
-or-
Fabrication part cannot be rotated because it is either unable to be re-sized or it is too constrained.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rotate failed because the fabrication part geometry could not be modified accordingly.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.PlaceFittingAsCutIn(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Connector,System.Double)
Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position.
doc:
The document.
straightId:
Id of the straight to be cut in.
fittingId:
Id of the fitting to cut in.
position:
The position to cut in the straight.
fittingConn:
The connector of the fitting to align with the primary connector of the straight part.
axisRotation:
Rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if cuts in successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
fittingConn is not a connector of the fitting.
-or-
fittingConn is not valid, it is not within a pair connector for cutting in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to align fitting to the straight to cut in.
-or-
There is no enough room in the run for cut in.
Since:
2017

Autodesk.Revit.DB.FabricationPart.PlaceAsTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double,System.Double,System.Double)
Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector.
Remarks:
Tap cannot be placed if it is already connected.
doc:
The document.
tapPartConn:
The connector of the part to place.
hostPartConn:
The connector of host part.
distance:
The distance to host part connector where to place the part.
axisRotation:
The axis rotation in radians.
secondaryAxisRotation:
The secondary axis rotation in radians.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a valid part to place as tap.
-or-
Tap should be placed on straight part.
-or-
The distance is out of range.
-or-
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
Invalid tap for host's profile type.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
tap is not connected by its primary connector.
Throws Autodesk::Revit::Exceptions::InvalidOpertationException:
tap does not fit on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.RotateConnectedTap(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationPart,System.Double,System.Double)
Rotates a connected fabrication tap by the specified angles about the primary and secondary axis.
doc:
The document.
tap:
The connected fabrication part tap to rotate.
primaryAxisRotateBy:
The primary axis rotation angle in radians to rotate by.
secondaryAxisRotateBy:
The secondary axis rotation angle in radians to rotate by.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Is not connected as a fabrication part tap.
-or-
tap cannot be rotated about the primary axis by the specified angle: primaryAxisRotateBy
-or-
tap cannot be rotated about the secondary axis by the specified angle: secondaryAxisRotateBy
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.AlignPartByInsertionPointAndCutInToStraight(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Boolean)
Align the part by its insertion point to a point and rotation on a straight. This will automatically size and connect the part being cut into, if possible.
document:
The document.
straightId:
The element identifier of the straight to be cut in to.
partId:
The element identifier of the part to align and cut in with.
position:
The position to move the parts insertion point to.
rotation:
The rotation in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
flip:
Flip the part to allow for flow direction.
Returns:
True if the alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element is not a fabrication part.
-or-
Not all of the fabrication part's connectors are open.
-or-
The part is not a straight.
-or-
The fabrication parts do not have matching domain types.
-or-
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to align the part to the straight to cut in to.
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Fabrication.FabricationPartJustification,Autodesk.Revit.DB.Transform)
Align the part by its connector to a point and rotation in free space.
document:
The document.
connector:
The connector to align in free space.
position:
The position to move the connector to.
rotation:
The rotation in radians.
rotationPerpendicular:
The perpendicular rotation for free placement around the Y axis direction of connection - angle in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification:
The justification to align eccentric parts.
trf:
Optional alignment transformation matrix, eg. a Trf that describes plan or side elevation.
Returns:
True if the alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByInsertionPoint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Fabrication.FabricationPartJustification,Autodesk.Revit.DB.Transform)
Align the part by its insertion point to a point and rotation in free space.
document:
The document.
partId:
The element identifier of the part to align.
position:
The position to move the part's insertion point to.
rotation:
The rotation in radians.
rotationPerpendicular:
The perpendicular rotation for free placement around the Y axis direction of connection - angle in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification:
The justification to align eccentric parts.
trf:
Optional alignment transformation matrix, eg. a Trf that describes plan or side elevation.
Returns:
True if the alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element is not a fabrication part.
-or-
Not all of the fabrication part's connectors are open.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByConnectorToConnector(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double,System.Double,Autodesk.Revit.DB.Fabrication.FabricationPartJustification)
Align a part by its connector to another connector. This will replace the FabricationPart::AlignPartByConnectors method.
document:
The document.
connector:
The connector of the fabrication part to move by in free space.
fixedConnector:
The connector for the fabrication part or family connector to align to.
rotation:
The rotation in radians.
slope:
The slope value to flex to match if possible in fractional units (eg.1/50). Positive values are up, negative are down. Slopes can only be applied
to fittings, whilst straights will inherit the slope from the piece it is connecting to.
justification:
The justification to align eccentric parts.
Returns:
True if the alignment succeeds, false otherwise and the part will not move from the original position.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018

Autodesk.Revit.DB.FabricationPart.AlignPartByConnectors(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,System.Double)
Moves fabrication part by one of its connectors and aligns it to another connector.
doc:
The document.
partConn:
The connector of the fabrication part to move and align by.
toConn:
The connector of the fabrication part or family to align to.
axisRotation:
Rotation around the direction of connection - angle between width vectors in radians.
Returns:
True if alignment succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For rectangular and oval parts the axis rotation must be a multiple of PI/2.
-or-
The connector does not belong to a fabrication part.
-or-
The fabrication part is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.ConnectAndCouple(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Makes a connection between the specified connectors and adds coupling if necessary.
Remarks:
This function does not place and align the fabrication part. Call AlignPartByConnectors before connecting.
doc:
The document.
partConn:
The connector of the fabrication part.
toConn:
The connector of the fabrication part or family to connect to.
Returns:
True if connection succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The connector does not belong to a fabrication part.
-or-
The fabrication part connectors are not aligned, call AlignPartByConnectors to align them.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.SplitStraight(Autodesk.Revit.DB.XYZ)
Splits the straight into two at the passed in point.
position:
The position to split in the straight.
Returns:
Returns the ElementId of the new straight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The part is not a straight.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SplitStraight(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Splits the straight into two at the passed in point.
document:
The document.
partId:
Id of the straight to split.
position:
The position to split in the straight.
Returns:
Returns the ElementId of the new straight.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The part is not a straight.
-or-
The position is not on the straight.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.CanSplitStraight(Autodesk.Revit.DB.XYZ)
Validates if the straight can be split into two at the passed in point.
position:
The position to split in the straight.
Returns:
Returns true if valid otherwise false if the straight cannot be split.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.FabricationPart.CanSplitStraight(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Validates if the straight can be split into two at the passed in point.
document:
The document.
partId:
Id of the straight to split.
position:
The position to split in the straight.
Returns:
Returns true if valid otherwise false if the straight cannot be split.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.IsStraightSegment(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Validates if the part is a straight.
document:
The document.
partId:
Id of the straight.
Returns:
Returns true if the part is a straight false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.Reposition(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Repositions the fabrication straight part to another end of the run.
doc:
The document.
partId:
Id of the fabrication part to reposition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
It is not a straight segment on the end in the run.
-or-
There are locked parts in the run.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2017

Autodesk.Revit.DB.FabricationPart.OptimizeLengths(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Optimizes the length fabrication straight parts.
doc:
The document.
partIds:
The ids of the fabrication parts in a selected fabrication part run.
Returns:
New and modified fabrication part ids in the optimize
Throws Autodesk.Revit.Exceptions.ArgumentException:
There are no straight parts to optimize, or all parts are locked or locked by group membership.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetProductListEntryCount
Gets the number of product entries for this part.
Returns:
Returns the number of product entries.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.GetProductListEntryName(System.Int32)
Gets the specified product list entry name.
index:
The product entry index.
Returns:
Returns the specified product entry name.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The product entry index is not larger than 0 and less than GetProductCount.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.IsProductList
Gets whether or not the fabrication part is a product list.
Returns:
Returns true if the fabrication part is a product list.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication part is not a product list.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.IsATap
Checks if it is any sort of tap.
Returns:
True if it is any sort of tap.
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsAHanger
Checks whether it is a hanger.
Returns:
True if the part is a hanger. False otherwise.
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsAStraight
Checks whether it is a straight part.
Returns:
True if the part is a straight part. False otherwise.
Since:
2016

Autodesk.Revit.DB.FabricationPart.AdjustEndLength(Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Adjusts the length for the specified connector.
partConn:
# The connector of the fabrication part to adjust length.
lengthToAdjust:
The length to adjust.
totalLengthOnly:
True if adjust the total length only when adjust length.
Returns:
The adjusted length.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end of the fabrication part of the connector can not be adjusted.
-or-
Connector is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FabricationPart.CanAdjustEndLength(Autodesk.Revit.DB.Connector)
Checks if the end of fabrication part can be adjusted.
partConn:
# The connector of the fabrication part to adjust length.
Returns:
True if the end of fabrication part can be adjusted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.FabricationPart.SetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.String)
Sets the calculated dimension value.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
value:
The calculated dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
value is not a valid calculated fabrication dimension value.
-or-
fabrication dimension is unable to be modified because it is locked or from a product list.
-or-
the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object.
-or-
the fabrication dimension cannot be set to the option: value.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetCalculatedDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the calculated dimension value.
dim:
The fabrication dimension.
Returns:
The calculated dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetDimensionCalculatedOptions(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the calculated options of the fabrication dimension.
dim:
The fabrication dimension.
Returns:
The calculated options of the fabrication dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.IsDimensionCalculated(Autodesk.Revit.DB.FabricationDimensionDefinition)
Checks if the fabrication dimension is calculated.
dim:
The fabrication dimension.
Returns:
True if the fabrication dimension is calculated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition,System.Double)
Sets the fabrication dimension value. The value is in Revit internal units.
Remarks:
Multiple dimensions may need to be set in order to reach the desired outcome.
The document must be regenerated before the fabrication part can be used.
Check ValidationStatus after regeneration to see if the part is valid for fabrication.
dim:
The fabrication dimension.
newValue:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fabrication dimension is unable to be modified because it is locked or from a product list.
-or-
the fabrication dimension is unable to be modified because it will affect the geometry of a connected end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the fabrication dimension is unable to be modified because the fabrication part is connected to more than one object.
-or-
the fabrication dimension cannot be set to the value: newValue.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetDimensionValue(Autodesk.Revit.DB.FabricationDimensionDefinition)
Gets the value of the fabrication dimension, returns value in Revit internal units.
dim:
The fabrication dimension.
Returns:
The dimension value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetDimensions
Gets all fabrication dimensions.
Returns:
Returns an array of fabrication dimensions.
Since:
2016

Autodesk.Revit.DB.FabricationPart.SetPositionByEnd(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.XYZ)
Positions the connector of the fabrication part element by the passed point.
connector:
The connector of the fabrication part element.
position:
The position to move to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetTransform
Gets the transformation matrix of the fabrication part element.
Returns:
The transformation matrix of the fabrication part element.
Since:
2016

Autodesk.Revit.DB.FabricationPart.CanASlopeBeApplied
This will test if a slope can be applied to the part and maintain connections with any connected parts.
Returns:
Returns true if the part can be successfully sloped otherwise false.
Since:
2018

Autodesk.Revit.DB.FabricationPart.SaveAsFabricationJob(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},System.String,Autodesk.Revit.DB.Fabrication.FabricationSaveJobOptions)
Save fabrication parts to an MEP job that can be opened in the fabrication software.
Remarks:
Only fabrication MAJ files are supported.
document:
The document.
ids:
List of element Ids of fabrication parts or assemblies and group elements that contain fabrication parts to save. Non-fabrication part elements will be ignored.
filename:
The full path and filename of the fabrication job to save.
saveOptions:
Options for the save operation.
Returns:
Returns a list of fabrication part element Ids that were saved to the fabrication job.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the path to the filename must already exist and be writeable
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Since:
2019

Autodesk.Revit.DB.FabricationPart.StretchAndFit(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId}@)
Stretch the fabrication part from the specified connector and fit to the target routing end.
Remarks:
Cannot stretch and fit fabrication part straight, tap or hanger.
document:
The document in which to perform the stretch and fit.
stretchConnector:
The connector of the fabrication part to be stretched.
target:
The target routing end to align and fit to.
newPartIds:
New fabrication part element identifiers.
Returns:
Returns FabricationPartFitResult::Success if successful.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Connector does not belong to a fabrication part with a valid fabrication service.
-or-
Connector is connected.
-or-
Connector belongs to a fabrication part straight, tap or hanger.
-or-
routing end is valid to route to.
-or-
stretch target end type must be a supported type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
fabrication part is not connected at one end only.
-or-
cannot stretch fabrication part to a different service.
Since:
2017

Autodesk.Revit.DB.FabricationPart.IsProductListEntryCompatibleSize(System.Int32)
Checks to see if this part can be changed to the specified product entry without altering any connected dimensions.
productEntry:
The product entry index.
Returns:
Returns true if the part can be changed to the specified product entry without altering any connected dimensions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The product entry index is not larger than 0 and less than GetProductCount.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.GetRodInfo
Gets the fabrication rod information.
Returns:
The fabrication rod information. Returns null if the fabrication part does not have any rod.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetHostedInfo
Gets the fabrication hosted element information.
Returns:
The fabrication hosted element information. Returns null if the fabrication part does not have a host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a free placed hanger.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
levelId:
The level identifier associated with the level.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2017

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Structural Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments and some kind of fittings.
-or-
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the distance is out of range.
-or-
cannot find suitable fabrication part for the host.
-or-
cannot place hanger on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Connector,System.Double,System.Boolean)
Creates a hanger on the fabrication part.
document:
The document.
button:
The fabrication service button to use. It finds the matching condition automatically if the button has multiple condition.
hostId:
The host part id. The host should be one horizontal straight part.
hostConnector:
The connector of the host.
distance:
The distance from the input connector of the host part. Units are in feet (ft).
attachToStructure:
Attach to the nearest structural element. The structural element might be one of Floor/Roof/Stair/Structure Framing.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Hangers may only be placed on straight horizontal fabrication segments and some kind of fittings.
-or-
Invalid fabrication service button.
-or-
The distance is out of range.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
cannot place hanger on the host.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationItemFile,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element from a fabrication item file.
document:
The document.
itemFile:
The fabrication item file.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The item file is not valid for use in Revit.
-or-
The item file has not been loaded into the configuration.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Double,System.Double,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button and size.
document:
The document.
button:
The fabrication service button to use. Matches button condition based on the specified size.
width:
The width of the part. Units are in feet (ft).
depth:
The depth of the part. Units are in feet (ft). It should be equal to width for round part.
levelId:
The element identifier associated with the Autodesk.Revit.DB.Level
the Autodesk.Revit.DB.FabricationPart will be created on.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
-or-
The ElementId levelId is not a Level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
-or-
failing to match a button condition based on specific size.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GetVersionHistory
Gets a history of version change information about the current part.
Returns:
A list of version information about the current part. The list starts with the most recent changes.
Since:
2019

Autodesk.Revit.DB.FabricationPart.ServiceType
The service type identifier of the fabrication part.
Since:
2018

Autodesk.Revit.DB.FabricationPart.GeometryChecksum
Gets the geometry checksum of the fabrication part symbol, and it does nothing with the fabrication part instance position.
Since:
2018.2

Autodesk.Revit.DB.FabricationPart.NeedToUpdateIsoDrawing
Changes happened and the iso drawing should be updated.
Since:
2019

Autodesk.Revit.DB.FabricationPart.SpoolName
The spool name of the fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2018

Autodesk.Revit.DB.FabricationPart.PartGuid
The fabrication part's globally unique identifier.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.PartStatus
The status identifier for the fabrication part.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.HangerRodKit
Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used.
Remarks:
For hangers only. Setting an invalid hanger rod kit will result in the property being unchanged.
Since:
2017 Subscription Update

Autodesk.Revit.DB.FabricationPart.ValidationStatus
The validation status of the fabrication part.
Since:
2016

Autodesk.Revit.DB.FabricationPart.ConnectorManager
The connector manager of the fabrication part.
Since:
2016

Autodesk.Revit.DB.FabricationPart.DomainType
The domain type for the fabrication part.
Since:
2016

Autodesk.Revit.DB.FabricationPart.ItemCustomId
The item custom identifier for the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ItemNumber
The item number that is used for identification, re-ordering from shop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2017

Autodesk.Revit.DB.FabricationPart.Material
The fabrication material identifier.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the material is not valid for the fabrication part's specification.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the material is not able to be modified.
-or-
When setting this property: the fabrication part is connected to more than one item.
-or-
When setting this property: the material fails to be set by identifier: materialId.
Since:
2016

Autodesk.Revit.DB.FabricationPart.InsulationSpecification
The fabrication part insulation specification identifier.
Remarks:
A value of 0 indicates the insulation specification is set to off.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the insulation specification is invalid for the fabrication part.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
-or-
When setting this property: the fabrication part has taps connected.
-or-
When setting this property: the specification fails to be set by identifier: specId.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Specification
The fabrication part specification identifier.
Remarks:
A value of 0 indicates the specification is set to undefined.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the specification is invalid for the fabrication part.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the specification is not able to be modified.
-or-
When setting this property: the fabrication part is connected to more than one item.
-or-
When setting this property: the specification fails to be set by identifier: specId.
Since:
2016

Autodesk.Revit.DB.FabricationPart.ServiceId
The fabrication part service identifier. The service can only be changed to compatible services.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property:
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart.ProductCode
The current database id of the part within the fabrication database.
Since:
2016

Autodesk.Revit.DB.FabricationPart.CenterlineLength
The centerline length of the fabrication part.
Since:
2018.1

Autodesk.Revit.DB.FabricationPart.Origin
The origin of the fabrication part element.
Since:
2016

Autodesk.Revit.DB.FabricationPart.LevelOffset
The associated level offset that indicates the distance from the center of the fabrication part to the current level.
Since:
2016

Autodesk.Revit.DB.FabricationPart.ProductInstallType
The product install type of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductOriginalEquipmentManufacture
The product original equipment manufacture (OEM) of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductDataRange
The product data range of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductSizeDescription
The product size description of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductMaterialDescription
The product material description of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductSpecificationDescription
The product specification description of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductFinishDescription
The product finish description of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductLongDescription
The product long description of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductShortDescription
The product short description of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductName
The product name of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.VendorCode
The vendor code of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.Vendor
The vendor of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.Alias
The alias of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.Notes
The notes of the fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2017

Autodesk.Revit.DB.FabricationPart.IsBoughtOut
True if the fabrication part is bought out.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ServiceName
The name of the service associated with the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.CutType
The cut type of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.DoubleWallMaterialArea
The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.
Since:
2017

Autodesk.Revit.DB.FabricationPart.DoubleWallMaterialThickness
The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero.
Since:
2017

Autodesk.Revit.DB.FabricationPart.DoubleWallMaterial
The double wall material identifier of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.MaterialThickness
The material thickness of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.SheetMetalArea
The sheet metal area of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.LiningArea
The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
Since:
2017

Autodesk.Revit.DB.FabricationPart.LiningThickness
The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero.
Since:
2017

Autodesk.Revit.DB.FabricationPart.LiningType
The lining type of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.InsulationArea
The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero.
Since:
2017

Autodesk.Revit.DB.FabricationPart.InsulationThickness
The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero.
Since:
2017

Autodesk.Revit.DB.FabricationPart.InsulationType
The insulation type of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.Weight
The weight of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.FreeSize
The inner size of the fabrication part.
Since:
2019

Autodesk.Revit.DB.FabricationPart.OverallSize
The overall size of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.Size
The size of the fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.Slope
The slope for the straight fabrication part.
Since:
2017

Autodesk.Revit.DB.FabricationPart.HasLining
True if the fabrication part is lined.
Since:
2017

Autodesk.Revit.DB.FabricationPart.HasInsulation
True if the fabrication part is insulated.
Since:
2017

Autodesk.Revit.DB.FabricationPart.HasDoubleWall
True if the fabrication part is double walled.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ServiceAbbreviation
The associated service abbreviation for the fabrication service.
Since:
2017

Autodesk.Revit.DB.FabricationPart.BottomOfPartElevation
The associated elevation to the bottom of fabrication part off of the current level.
Since:
2017

Autodesk.Revit.DB.FabricationPart.TopOfPartElevation
The associated elevation to the top of fabrication part off of the current level.
Since:
2017

Autodesk.Revit.DB.FabricationPart.ProductListEntry
The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list.
Remarks:
The product list is a catalog of available sizes for the part and the index refers to the entry on this list.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: modifying the product entry will cause the dimensions of connected ends to change.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The product entry index is not larger than 0 and less than GetProductCount.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
-or-
When setting this property: the product entry fails to be set by index: productEntryIndex.
Since:
2016 Subscription Release

Autodesk.Revit.DB.FabricationPart
Represents a fabrication component in the Autodesk Revit MEP product.
Since:
2016